#include <stdio.h>
int main()
{
    printf("\n请把方框中的东西移走\n\n");
    char e[5][6];
    char a;
    int b=0,c=0,d=0,f=0,step=0;
    int i=0,j=0;
    for(; i<5; i++)
    {
        for(; j<6; j++)
            e[i][j]=' ';
    }
    e[1][1]='>';
    e[1][3]='^';
    e[3][3]='v';
    printf("-------------------------------\n");
    printf("| %c | %c | %c | %c | %c | %c |\n",e[0][0],e[0][1],e[0][2],e[0][3],e[0][4],e[0][5]);
    printf("-------------------------------\n");
    printf("| %c | %c | %c | %c | %c | %c |\n",e[1][0],e[1][1],e[1][2],e[1][3],e[1][4],e[1][5]);
    printf("-------------------------------\n");
    printf("| %c | %c | %c | %c | %c | %c |\n",e[2][0],e[2][1],e[2][2],e[2][3],e[2][4],e[2][5]);
    printf("-------------------------------\n");
    printf("| %c | %c | %c | %c | %c | %c |\n",e[3][0],e[3][1],e[3][2],e[3][3],e[3][4],e[3][5]);
    printf("-------------------------------\n");
    printf("| %c | %c | %c | %c | %c | %c |\n",e[4][0],e[4][1],e[4][2],e[4][3],e[4][4],e[4][5]);
    printf("-------------------------------\n");
    for(;;)
    {
        printf("您选择的箭头是：\n  1:>\n  2:^\n  3:v\n  r:重开\n \n");
        scanf("%c*c",&a);
        switch (a)
        {
        case '1':
        case '>':
            b+=1,step+=1;
            break;
        case '2':
        case '^':
            c+=1,step+=1;
            break;
        case '3':
        case 'V':
        case 'v':
        {
            d+=1,step+=1;
            break;
        }
        case 'R':
        case 'r':
            step=0,b=0,c=0,d=0,f=0;
            break;
        default:
            printf("error！\n");
            break;
        }
        if(b==2)if(c==0)f=1;
        for(; i<5; i++)
        {
            for(; j<6; j++)
                e[i][j]=' ';
        }
        if(f==1) c=3;
        if(b>4) b=30;
        e[1][1+b]='>';
        e[1-c][3]='^';
        e[3+d][3]='v';
        printf("-------------------------------\n");
        printf("| %c | %c | %c | %c | %c | %c |\n",e[0][0],e[0][1],e[0][2],e[0][3],e[0][4],e[0][5]);
        printf("-------------------------------\n");
        printf("| %c | %c | %c | %c | %c | %c |\n",e[1][0],e[1][1],e[1][2],e[1][3],e[1][4],e[1][5]);
        printf("-------------------------------\n");
        printf("| %c | %c | %c | %c | %c | %c |\n",e[2][0],e[2][1],e[2][2],e[2][3],e[2][4],e[2][5]);
        printf("-------------------------------\n");
        printf("| %c | %c | %c | %c | %c | %c |\n",e[3][0],e[3][1],e[3][2],e[3][3],e[3][4],e[3][5]);
        printf("-------------------------------\n");
        printf("| %c | %c | %c | %c | %c | %c |\n",e[4][0],e[4][1],e[4][2],e[4][3],e[4][4],e[4][5]);
        printf("---------------%d--------------\n\n\n\n\n",step);
        if(step>14)
            printf("\n\n什么破游戏我不玩了(╯‵□′)╯︵┻━┻\n");
        if(b>4&&c>1&&d>1)
        {
            printf("\n恭喜过关o(*≥▽≤)ツ\n");
            if(step<=9)
                printf("等级SSS\n");
            if(step>9&&step<11)
                printf("等级A\n");
            if(step>=11)
                printf("等级B\n");
        }
    }
    printf("你的步数为%d\n\n\n",step);
    return 0;
}

